# 网络搭建基础

#### 进入配置模式

```shell
switch> enable                                          //进入特权模式
switch# configure ferminal                              //进入全局配置模式
switch(config)# hostname SW-1                           //配置设备名称
```

#### 配置ip地址

```shell
SW-1(config)# interface fastEthernet 1/0/1                //进入端口
SW-1(config-if-ethernet1/0/1)# ip address 192.168.254.10 255.255.255.252   //配置ip地址
SW-1(config)# no shutdown                                 //激活端口
```

>+ 神州数码设备不需要打这条配置
>
>>no shutdown

#### 配置静态路由

```shell
SW-1(config)# ip route 192.168.20.0 255.255.255.0 192.168.254.2 
```

**在这条命令中192.168.20.0是目标网段的网络地址，255.255.255.0是此目标网段的掩码.**
**192.168.254.2是这条路由的下一跳，下一跳必须是在路由表里的直连可达路由.**

#### 配置缺省路由

在网络搭建中，缺省路由是**必不可缺**的，它是静态路由的一种。当路由表没有任何一条明细路由匹配时，将会使用缺省路由转发该报文。

```shell
SW-1(config)# ip route 0.0.0.0 0.0.0.0 192.168.254.2
```

缺省路由目标网段和其子网掩码都是0，有效 地指向所有目标网段。
值得一提的是，缺省路由不仅可以通过手动配置，也可以通过动态路由协议发布。我们将在后面学习动态路由协议时提到。

#### 配置本地回环

操作起来类似网卡的一个虚拟接口，用于设备测试和管理，默认永远激活。

```shell
SW-1(config)# interface loopback 1 
SW-1(config)# ip address 1.1.1.1 255.255.255.255
SW-1(config)# ip address 2.2.2.2 255.255.255.255 secondary
```

回环地址子网掩码一般全为1，可以在一个回环口上设置**多个**回环地址，最好不要这样做。

#### 配置串口

```shell
RT-1(config)# interface serial 1/0 
RT-1(config)# encapsulation hdlc/ppp 
RT-1(config)# physical-layer speed 2048000
RT-1(config)# ip address 172.16.254.1 255.255.255.252 
```

串口可以封装hdlc和ppp协议,根据不同情况使用。详情可见： [hdlc和ppp(串行链路协议)](https://www.cnblogs.com/Mrspe/articles/12443558.html)
>串口两端必须要规定相同的速率,s1/0对应对端的s1/1端口
>>physical-layer speed 2048000

#### Vlan

vlan是网络搭建中很基础的一部分，是网络的主要组成部分之一。vlan用来分割广播域，同一个vlan内的主机可以互通，而vlan间则不能直接互通。vlan增强了网络的健壮性和安全性，同时使网络构建和维护更为灵活。详见： [vlan是如何工作的](https://info.support.huawei.com/info-finder/encyclopedia/zh/VLAN.html)

```shell
SW-1(config)# vlan 10 
SW-1(config-vlan)# ip address 192.168.10.254 255.255.255.0
SW-1(config-vlan)# interface Ethernet 1/0/1
SW-1(config-if-ethernet1/0/1)# switchport access vlan 10
SW-1(config-if-ethernet1/0/1)# switchport mode trunk
SW-1(config-if-ethernet1/0/1)# switchport trunk allowed vlan 
```

access模式只能允许对应的vlan标记帧通过，trunk则是允许多个带vlan的标记帧通过，但只允许属于缺省VLAN的帧从该类接口上发出时不带Tag.
